# <center>Merging DataFrames</center>

### importar pandas

In [1]:
import pandas as pd

### definindo dataframes

In [2]:
df1 = pd.DataFrame({'letter': ['A', 'B', 'C', 'D'],
                   'number': [1, 2, 3, 4]})
df2 = pd.DataFrame({'letter': ['C', 'D', 'E', 'F'],
                   'number': [3, 4, 5, 6]})

### left join

In [3]:
df1.merge(df2, how='left', on='number')

  letter_x  number letter_y
0        A       1      NaN
1        B       2      NaN
2        C       3        C
3        D       4        D

### inner join

In [4]:
df1.merge(df2, how='inner', left_on='number', right_on='number')

  letter_x  number letter_y
0        C       3        C
1        D       4        D

### right join

In [5]:
df1.merge(df2, how='right', on='number', suffixes=('', '_right'))

  letter  number letter_right
0      C       3            C
1      D       4            D
2    NaN       5            E
3    NaN       6            F

### Union com pd.concat
para n√£o repitir valores usar:

**df3 = pd.concat([df1, df2]).drop_duplicates().reset_index(drop=True)**

In [18]:
df3 = pd.concat([df1, df2]).reset_index(drop=True)
df3

  letter  number
0      A       1
1      B       2
2      C       3
3      D       4
4      C       3
5      D       4
6      E       5
7      F       6

### concatenar dataframes na horizontal (um ao lado do outro)

In [7]:
df4 = pd.concat([df1, df2], axis=1)
df4

  letter  number letter  number
0      A       1      C       3
1      B       2      D       4
2      C       3      E       5
3      D       4      F       6

### aicionando uma nova linha ao dataframe

**OBS:** verificar erro no m√©todo append

In [31]:
new_row = pd.Series(['Z', 26], index=df3.columns)
# df3.append(new_row, ignore_index=True)

### usando a fun√ß√£o join

In [29]:
join_df = pd.DataFrame({'letter': ['F', 'G', 'H', 'I'],
                       'number': [6, 7, 8, 9]})

In [30]:
df2.join(join_df, rsuffix='_right')

  letter  number letter_right  number_right
0      C       3            F             6
1      D       4            G             7
2      E       5            H             8
3      F       6            I             9